Revit 2027 API
CableSize.NumberOfNeutralConductors Property
 The number of Neutral Conductors.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfNeutralConductors { get; set; }
Public Property NumberOfNeutralConductors As Integer
	Get
	Set
public:
property int NumberOfNeutralConductors {
	int get ();
	void set (int value);
}
member NumberOfNeutralConductors : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for numberOfNeutralConductors is negative.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace